# brew bundle dump
# brew bundle
tap "homebrew/bundle"

# === Programming Languages & Runtimes ===
brew "python@3.12"
brew "node"               # JavaScript runtime
brew "deno"			  	# Secure JavaScript/TypeScript runtime

# === Version Control ===
brew "git"
brew "gh"                 # GitHub CLI

# === Front-End Tools ===
brew "yarn"               # Package manager
brew "fonttools"          # Font manipulation
brew "pnpm"               # Fast, disk space efficient package manager
brew "gulp-cli"           # Task runner for automation
brew "vite"               # Modern frontend tooling (preferred over webpack)
# brew "webpack"          # Legacy module bundler
brew "parcel"             # Blazing fast, zero configuration web application bundler

# === Database Tools ===
brew "postgresql"         # Object-relational database system
brew "redis"              # In-memory data structure store
brew "mongodb-community"  # NoSQL database

# === API Development ===
brew "postman"
brew "insomnia"           # API design and testing tool
brew "curl"               # Command line tool for transferring data with URLs
brew "httpie"             # User-friendly HTTP client

# === Containerization & Virtualization
brew "docker"             # Container platform
brew "podman"             # Alternative container platform
brew "minikube"           # Local Kubernetes
brew "kubernetes-cli"     # Command-line tool for Kubernetes
brew "vagrant"            # Tool for building and managing virtualized development environments

# === Testing Tools ===
brew "cypress"            # Front-end testing tool
brew "jest"               # JavaScript testing framework
brew "mocha"              # JavaScript test framework
brew "chai"               # Assertion library for Node.js and browsers
brew "enzyme"             # JavaScript testing utility for React
brew "puppeteer"          # Node library which provides a high-level API to control Chrome or Chromium
brew "playwright"         # Node library to automate the Chromium, WebKit, and Firefox browsers
brew "selenium-server-standalone" # Selenium server for browser automation
brew "k6"                 # Modern load testing tool
brew "locust"             # Scalable user load testing tool

# === Static Site Generators ===
brew "jekyll"             # Static site generator
brew "hugo"               # Another static site generator
brew "gatsby-cli"         # CLI for Gatsby.js
# brew "next"               # Next.js CLI
# brew "nuxt"               # Nuxt.js CLI

# We should use npm global installations in setup.sh:
# npm install -g next
# npm install -g create-nuxt-app

# === Web Performance Tools ===
brew "lighthouse"         # Website auditing tool
brew "imageoptim-cli"     # Image optimization

# === Terminal Enhancements ===
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "htop"
brew "jq"                 # JSON processor
brew "neofetch"
brew "tree"
brew "ncdu"
brew "glances"
brew "wget"
brew "nmap"
cask "warp"               # Modern, GPU-accelerated terminal with AI features

# === Front-End Desktop Apps ===
cask "visual-studio-code" # Code editor
cask "figma"              # UI design tool
cask "browser-stack"      # Cross-browser testing
cask "responsively-app"   # Responsive web design testing

# === Browsers for Testing ===
cask "google-chrome"
cask "firefox"
cask "firefox-developer-edition"
cask "brave-browser"

# === Productivity ===
cask "bitwarden"          # Password manager
cask "alfred"             # App launcher
cask "bartender"          # Menu bar organizer
cask "chatgpt"            # AI assistant
cask "github"             # GitHub client
cask "iterm2"             # Terminal
cask "snagit"             # Screenshot tool
cask "utm"                # Virtual machines
cask "vagrant"            # Development environments
cask "vlc"                # Media player
cask "wireshark"          # Network analyzer
cask "protonvpn"          # VPN
cask "affinity-photo"     # Image editor

# === VS Code Extensions ===
# Front-End Essentials
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "bradlc.vscode-tailwindcss"      # Tailwind CSS
vscode "dsznajder.es7-react-js-snippets" # React snippets
vscode "formulahendry.auto-rename-tag"
vscode "ritwickdey.liveserver"
vscode "mrmlnc.vscode-autoprefixer"

# JavaScript/TypeScript
vscode "ms-vscode.vscode-typescript-tslint"
vscode "rvest.vs-code-prettier-eslint"
vscode "standard.vscode-standard"

# React/Vue/Angular
vscode "angular.ng-template"
vscode "vue.volar"

# Styling
vscode "syler.sass-indented"
vscode "ecmel.vscode-html-css"
vscode "jock.svg"
vscode "simonsiefke.svg-preview"

# Productivity
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "christian-kohler.path-intellisense"
vscode "vincaslt.highlight-matching-tag"
vscode "pkief.material-icon-theme"
vscode "zhuangtongfa.material-theme"

# Additional Extensions
vscode "mechatroner.rainbow-csv"
vscode "humao.rest-client"
vscode "fabiospampinato.vscode-terminals"
vscode "spywhere.guides"
vscode "shardulm94.trailing-spaces"
vscode "editorconfig.editorconfig"
vscode "bmewburn.vscode-intelephense-client"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "nonoroazoro.syncing"
vscode "undefined_publisher.spacetotabsonsave"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "xdebug.php-debug"
