# brew bundle dump
# brew bundle
tap "homebrew/bundle"
tap "supabase/tap"

# === Programming Languages & Runtimes ===
brew "python@3.12"
brew "node"               # JavaScript runtime (includes npm)
brew "deno"               # Secure JavaScript/TypeScript runtime

# === Version Control ===
brew "git"
brew "gh"                 # GitHub CLI

# === Front-End Tools ===
brew "yarn"               # Package manager (Homebrew recommended over npm)
brew "fonttools"          # Font manipulation
brew "pnpm"               # Fast, disk space efficient package manager

# === Backend & API Tools ===
brew "supabase"               # Supabase CLI for local development

# === Database Tools ===
brew "postgresql"         # Object-relational database system
brew "redis"              # In-memory data structure store

# === API Development ===
cask "postman"            # API platform for building and using APIs
cask "insomnia"           # REST and GraphQL API client
brew "curl"               # Command line tool for transferring data with URLs
brew "httpie"             # User-friendly HTTP client

# === Containerization & Virtualization ===
brew "docker"             # Container platform
brew "podman"             # Alternative container platform
brew "minikube"           # Local Kubernetes
brew "kubernetes-cli"     # Command-line tool for Kubernetes
cask "vagrant"            # Tool for building and managing virtualized development environments

# === Testing Tools ===
brew "selenium-server-standalone" # Selenium server for browser automation
brew "k6"                 # Modern load testing tool
brew "locust"             # Scalable user load testing tool

# === Static Site Generators ===
brew "hugo"               # Static site generator (Go-based, use Homebrew)

# === Terminal Enhancements ===
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "htop"
brew "jq"                 # JSON processor
brew "neofetch"
brew "tree"
brew "ncdu"
brew "glances"
brew "wget"
brew "nmap"
cask "warp"               # Modern, GPU-accelerated terminal with AI features

# Added modern CLI tools
brew "ripgrep"            # Fast text search
brew "bat"                # Cat clone with syntax highlighting
brew "fd"                 # Simple, fast, user-friendly alternative to find
brew "eza"                # Modern replacement for ls
brew "starship"           # Minimal, blazing-fast shell prompt
brew "zoxide"             # Smarter cd command

# === Front-End Desktop Apps ===
cask "visual-studio-code" # Code editor
cask "figma"              # UI design tool
cask "browserstacklocal"  # Cross-browser testing
cask "responsively"       # Responsive web design testing

# === Browsers ===
cask "google-chrome"
cask "firefox"
cask "firefox@developer-edition"
cask "brave-browser"

# === Utilities ===
cask "bitwarden"          # Password manager
cask "alfred"             # Productivity app
cask "bartender"          # Menu bar organizer
cask "chatgpt"            # ChatGPT client
cask "github"             # GitHub desktop client
cask "iterm2"             # Terminal emulator
# cask "snagit"             # Screen capture software
cask "vlc"                # Media player
cask "wireshark"          # Network protocol analyzer
cask "protonvpn"          # VPN client
cask "affinity-photo"     # Photo editing software

# === Fonts ===
cask "font-fira-code-nerd-font"
