# brew bundle dump
# brew bundle
tap "homebrew/bundle"
brew "python@3.12"
brew "fonttools"
brew "gh"
brew "git"
brew "htop"
brew "jq"
brew "neofetch"
brew "nmap"
brew "node"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tree"
brew "ncdu"
brew "glances"
cask "affinity-photo"
cask "alfred"
cask "bartender"
cask "bitwarden"
cask "chatgpt"
cask "github"
cask "iterm2"
cask "snagit"
cask "utm"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "protonvpn"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "eg2.tslint"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-terminals"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "humao.rest-client"
vscode "jock.svg"
vscode "mechatroner.rainbow-csv"
vscode "mrmlnc.vscode-autoprefixer"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "nonoroazoro.syncing"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "shardulm94.trailing-spaces"
vscode "simonsiefke.svg-preview"
vscode "spywhere.guides"
vscode "standard.vscode-standard"
vscode "syler.sass-indented"
vscode "undefined_publisher.spacetotabsonsave"
vscode "unifiedjs.vscode-mdx"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "xdebug.php-debug"
vscode "zhuangtongfa.material-theme"
