affinity-photo
alfred
bartender
bitwarden
brave-browser
browserstacklocal
chatgpt
figma
firefox
firefox@developer-edition
flutter
github
google-chrome
insomnia
iterm2
postman
protonvpn
responsively
snagit
utm
vagrant
visual-studio-code
vlc
warp
wireshark
