antiantisepticeye.vscode-color-picker
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
chrisdias.promptboost
christian-kohler.path-intellisense
codeium.codeium
dbaeumer.vscode-eslint
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
fabiospampinato.vscode-terminals
formulahendry.auto-rename-tag
github.codespaces
github.copilot
github.copilot-chat
github.copilot-workspace
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
google.geminicodeassist
humao.rest-client
jock.svg
josee9988.minifyall
mechatroner.rainbow-csv
mrmlnc.vscode-autoprefixer
mrmlnc.vscode-duplicate
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-dotnettools.vscodeintellicode-csharp
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.extension-test-runner
ms-vscode.live-server
ms-vscode.powershell
ms-vscode.remote-repositories
ms-vscode.vscode-websearchforcopilot
nonoroazoro.syncing
openai.chatgpt
perkovec.emoji
pkief.material-icon-theme
rioj7.vscode-remove-comments
ritwickdey.liveserver
rooveterinaryinc.roo-cline
rvest.vs-code-prettier-eslint
saoudrizwan.claude-dev
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
simonsiefke.svg-preview
sourcegraph.cody-ai
spywhere.guides
standard.vscode-standard
supermaven.supermaven
syler.sass-indented
undefined_publisher.spacetotabsonsave
unifiedjs.vscode-mdx
vincaslt.highlight-matching-tag
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
vue.volar
xdebug.php-debug
zhuangtongfa.material-theme
